app/Controllers/Home.php

INSERT INTO `tb_pessoas` (`nome`, `profissao`, `idade`, `senha`) VALUES ('Joshua', 'Atrasador de trabalho', '2', '202cb962ac59075b964b07152d234b70')
---
    public function gravar(){

        $data['session'] = \Config\Services::session();

        if(!$data['session']->get('logado')){
            return redirect("login");
        }

        $model = new PessoasModel();

        $model->save([
            'id' => $this->request->getVar('id'),
            'nome' => $this->request->getVar('nome'),
            'profissao' => $this->request->getVar('profissao'),
            'idade' => $this->request->getVar('idade')
        ]);